// 1. Если переменная a равна нулю, то выведите 'Верно', иначе
// выведите 'Неверно'. Проверьте работу скрипта при a, равном
// 1, 0, -3.

let a = -3;

if (a === 0) {
    console.log('1 Верно');
} else {
    console.log('1 Неверно');
}

// 2. Если переменная a больше нуля, то выведите 'Верно', иначе
// выведите 'Неверно'. Проверьте работу скрипта при a, равном
// 1, 0, -3.

let a1 = -3;

if (a1 > 0) {
    console.log('2 Верно');
} else {
    console.log('2 Неверно');
}

// 3. Если переменная a меньше нуля, то выведите 'Верно', иначе
// выведите 'Неверно'. Проверьте работу скрипта при a, равном
// 1, 0, -3.

let a3 = -3;

if (a3 < 0) {
    console.log('3 Верно');
} else {
    console.log('3 Неверно');
}

// 4. Если переменная a больше или равна нулю, то выведите
// 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта
// при a, равном 1, 0, -3.

let a4 = 1;

if (a4 >= 0) {
    console.log('4 Верно');
} else {
    console.log('4 Неверно');
}

// 5. Если переменная a меньше или равна нулю, то выведите
// 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта
// при a, равном 1, 0, -3.

let a5 = -1;

if (a5 <= 0) {
    console.log('5 Верно');
} else {
    console.log('5 Неверно');
}

// 6. Если переменная a не равна нулю, то выведите 'Верно', иначе
// выведите 'Неверно'. Проверьте работу скрипта при a, равном
// 1, 0, -3.

let a6 = 9;

if (a6 !== 0) {
    console.log('6 Верно');
} else {
    console.log('6 Неверно');
}

// 7. Если переменная a равна 'test', то выведите 'Верно', иначе
// выведите 'Неверно'. Проверьте работу скрипта при a, равном
// 'test', 'тест', 3.

let a7 = 'test';

if (a7 === 'test') {
    console.log('7 Верно');
} else {
    console.log('7 Неверно');
}

// 8. Если переменная a равна '1' и по значению и по типу, то
// выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу
// скрипта при a, равном '1', 1, 3.

let a8 = '1';

if (a8 == 1) {
    console.log('8 Верно');
} else {
    console.log('8 Неверно');
}