// Если переменная test равна true, то выведите 'Верно', иначе
// выведите 'Неверно'. Проверьте работу скрипта при test,
// равном true, false. Напишите два варианта скрипта - с короткой
// записью и с длинной.

let test = false;

let result = test ? 'Верно' : 'Неверно'
console.log(result);

// 2. Если переменная test не равна true, то выведите 'Верно',
// иначе выведите 'Неверно'. Проверьте работу скрипта при test,
// равном true, false. Напишите два варианта скрипта - с короткой
// записью и с длинной.

let test1 = false;

let result1 = !test1 ? 'Верно' : 'Неверно'
console.log(result1);